
map_game = {
    'деревня': {
            'описание': '',
            'направления': {'вперед' : 'тропа'},
            'враги': [],
            'инвентарь': ['сосиска']
    },
    'тропа': {
            'описание': '',
            'направления': {'на лево': 'тёмный лес', 'на право': 'пещера кащея'},
            'враги': [],
            'инвентарь': []
    },
    'тёмный лес': {
        'описание': '',
        'направления': {},
        'враги': [],
        'инвентарь': []
    },
    'пещера кащея': {
        'описание': '',
        'направления': {},
        'враги': [],
        'инвентарь': []
    }

}

inventory = {
    'сосиска' : {'здоровье': 50, 'мощность': 30, 'защита': 20, 'опыт': 1}
}

enemy = {

}

person = {
    'здоровье': '100',
    'инвентарь': [],
    'локация': 'деревня'
}

def print_step():
    print("*************************")
    for key, value in person.items():
        if key == 'локация':
            print(map_game[value]['описание'])
        else:
            print(f"{key} - {value}")
    print("*************************")

while True:
